In [2]:
#import from pandas as pd
import pandas as pd

In [5]:
#Assign the data in Cruise Ships 
cruise_ships = pd.read_csv("cruise_ships.csv")
cruise_ships.head()

                    Name                        Operator  Year  Tonnage
0                 Adonia                         Azamara  2001   30,277
1                Adriana                Adriana Shipping  1972    4,490
2  Adventure of the Seas   Royal Caribbean International  2001  137,276
3         Aegean Goddess       Cruise & Maritime Voyages  1994   55,819
4         Aegean Majesty  Optimum Shipmanagement Service  1996   55,451

In [7]:
#Selec the operators column from Cruise Ships
operators = cruise_ships["Operator"]
operators.head()

0                           Azamara
1                  Adriana Shipping
2     Royal Caribbean International
3         Cruise & Maritime Voyages
4    Optimum Shipmanagement Service
Name: Operator, dtype: object

In [9]:
#Select the tonnages column from Tonnages
tonnages = cruise_ships["Tonnage"]
tonnages.head()

0     30,277
1      4,490
2    137,276
3     55,819
4     55,451
Name: Tonnage, dtype: object

In [13]:
#Select the Name column from Cruise Ships
cruise_names = cruise_ships["Name"]
cruise_names.head()

0                   Adonia
1                  Adriana
2    Adventure of the Seas
3           Aegean Goddess
4           Aegean Majesty
Name: Name, dtype: object